2023-12-19/d656f61fce-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>workqueue工作队列</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">workqueue工作队列</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga1e7ca0">1. 为什么需要工作队列?</a></li>
<li><a href="#org8048766">2. 工作队列的概念</a></li>
<li><a href="#orgb3504ee">3. 工作队列的特性</a></li>
<li><a href="#org1b43478">4. 实现（共享工作队列和自定义工作队列）</a></li>
</ul>
</div>
</div>
<p>
REFERENCE: <a href="https://blog.csdn.net/u013253075/article/details/128396565">https://blog.csdn.net/u013253075/article/details/128396565</a>
</p>
<div id="outline-container-orga1e7ca0" class="outline-2">
<h2 id="orga1e7ca0"><span class="section-number-2">1.</span> 为什么需要工作队列?</h2>
<div class="outline-text-2" id="text-1">
<p>
内核代码中，经常遇到不能或不合适去马上调用某个处理过程，此时希望将该工作推送给某个
内核线程执行，这样做的原因有很多，比如：
</p>
<ul class="org-ul">
<li>中断触发了某个过程的执行条件，而该过程执行时间较长或者调用导致睡眠函数，则该过程
不应该在中断上下文立即被调用。</li>
<li>类似于中断，一些紧急的任务不希望执行比较耗时的非关键过程，则需要把该过程提交到低
优先级线程执行。比如一个轮询的通信接收线程，它需要快速完成检测和接收数据，而对数
据解析则应该交由低优先级线程慢慢处理。</li>
<li>有时候希望将一些工作集中起来以获取批处理的性能；或则合并缩减一些执行线程，减少
资源消耗。</li>
<li>基于以上需求，人们开发出了工作队列这一机制。工作队列不光在操作系统内核中会用到，
一些应用程序或协议栈也会实现的工作队列。</li>
</ul>
</div>
</div>

<div id="outline-container-org8048766" class="outline-2">
<h2 id="org8048766"><span class="section-number-2">2.</span> 工作队列的概念</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>工作队列</b> 是将操作(或回调)延期异步执行的一种机制。工作队列可以把工作推后，交由一个
内核线程去执行，并且工作队列是执行在线程上下文中，因此工作执行过程中可以被创新调度、
抢占、睡眠。
<b>工作项</b> 是工作队列中的元素，是一个回调函数和多个回调函数输入参数的集合，有时也会
有额外的属性成员，总之通过一个结构体即可记录和描述一个工作项。
</p>
</div>
</div>

<div id="outline-container-orgb3504ee" class="outline-2">
<h2 id="orgb3504ee"><span class="section-number-2">3.</span> 工作队列的特性</h2>
<div class="outline-text-2" id="text-3">
<p>
通过一个工作队列来执行一个工作相比于直接执行，会有以下特性：
</p>
<ul class="org-ul">
<li>异步，工作不是在本中断或线程中执行，而是交由其他线程执行。</li>
<li>延期，交由低优先级线程执行，执行前可能被抢占，也可能有其他工作排在前面执行，所以
提交工作队列到工作真正被执行之间会延时不定长时间。</li>
<li>排队，FIFO模式先到先执行。也肯定会有多个优先级的工作队列，低优先级的工作队列要等
高优先级执行完才能执行。但同一工作队列内部顺序一定。</li>
<li>缓存，队列能缓存多个项，需要异步执行就丢进去。但有上限，满之后，新的入队项会被丢
弃，丢弃个数会被统计下来。</li>
</ul>
</div>
</div>

<div id="outline-container-org1b43478" class="outline-2">
<h2 id="org1b43478"><span class="section-number-2">4.</span> 实现（共享工作队列和自定义工作队列）</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>共享工作队列：将新创建的工作任务添加到Linux内核创建的全局工作队列system_wq中，
无需自己创建工作队列；</li>
<li>自定义工作队列：将新创建的工作任务添加到自己创建的工作队列中；</li>
</ol>

<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold;">flush_work</span>(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#22581;&#22622;&#24037;&#20316;&#38431;&#21015;&#65292;&#30452;&#21040;&#24037;&#20316;&#20219;&#21153;&#23436;&#25104;</span>
  <span style="font-weight: bold;">flush_delayed_work</span>(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#31561;&#24453;&#24310;&#26102;&#24037;&#20316;&#20219;&#21153;&#23436;&#25104;</span>
  <span style="font-weight: bold;">cancel_work_sync</span>();   <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#21462;&#28040;&#24037;&#20316;&#38431;&#21015;&#24182;&#31561;&#24453;&#23427;&#30340;&#23436;&#25104;</span>
  <span style="font-weight: bold;">cancel_delayed_work</span>(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#21462;&#28040;&#24310;&#26102;&#24037;&#20316;&#20219;&#21153;</span>
  <span style="font-weight: bold;">cancel_delayed_work_sync</span>(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#21462;&#28040;&#24310;&#26102;&#24037;&#20316;&#20219;&#21153;&#24182;&#31561;&#24453;&#23427;&#23436;&#25104;</span>
  <span style="font-weight: bold;">create_workqueue</span>();    <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#23545;&#20110;&#22810;CPU&#31995;&#32479;&#65292;&#20869;&#26680;&#20250;&#22312;&#27599;&#20010;CPU&#19978;&#21019;&#24314;&#19968;&#20010;&#24037;&#20316;&#38431;&#21015;&#65292;&#20351;&#32447;&#31243;&#22788;&#29702;&#24182;&#34892;&#21270;</span>
  <span style="font-weight: bold;">create_singlethread_workqueue</span>(); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&#20869;&#26680;&#21482;&#22312;&#19968;&#20010;CPU&#19978;&#21019;&#24314;&#19968;&#20010;&#24037;&#20316;&#38431;&#21015;</span>
  <span style="font-weight: bold;">queue_work_on</span>();&#22312;&#25351;&#23450;CPU&#19978;&#28155;&#21152;&#24037;&#20316;&#20219;&#21153;&#65292;queue_work()<span style="font-weight: bold;">&#35843;&#29992;queue_work_on</span>()&#22312;&#25152;&#26377;CPU&#19978;&#28155;&#21152;&#20219;&#21153;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
